---
kind: other
id: Methods.T:Autodesk.Revit.DB.Element
zh: 构件、图元、元素
source: html/684a27e5-aa6c-4ab7-6758-c25a204bd96f.htm
---
# Element Methods

**中文**: 构件、图元、元素

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.